{"inkVersion":21,"root":[["\n",{"->":"main"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"main":[["ev","str","^chooseRdmCard","/str",{"x()":"Unity_Event","exArgs":1},"pop","/ev","\n","^Our journey is going better than expected so far. I was planning on more encounters with pirates. Besides, we only had to stand our ground against individual ships, there are also many pirates who command entire fleets. But there's something coming up today that I'm not looking forward to at all. <color=\"red\">Last night my navigator fell asleep during his night shift</color> and we sailed the wrong course all night because of it. It's now up to me to decide whether to <color=\"red\">send him over the plank or spare him</color>. If I let him go unpunished, it may make me look weak, and it could encourage further misbehavior among the crew. But is it truly fair to send him to his death for something as simple as falling asleep once? What should I do?","\n","ev","str","^Punish","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Spare","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":[{"->":"Planke"},"\n",{"#f":5}],"c-1":[{"->":"Weiterziehen"},"\n",{"#f":5}]}],{"#f":1}],"Planke":["ev","str","^plank","/str",{"x()":"Unity_Event","exArgs":1},"pop","/ev","\n","^<color=\"red\">I have decided to judge strictly</color>. It will show my crew that I'm prepared to be tough so that we can get our hands on this treasure. But I also feel a little sorry for my navigator, he was a good man and loyal to our cause, but he knew the rules. <color=\"red\">(-1 Card)</color>","\n",{"->":"endScene"},{"#f":1}],"Weiterziehen":["ev","str","^spare","/str",{"x()":"Unity_Event","exArgs":1},"pop","/ev","\n","^<color=\"red\">I have decided to spare him</color>. I want to give him a second chance. He is very loyal to our cause and he begged me for mercy, which I granted him. However, some of the crew didn't seem happy with this decision. I must expect that they will try to push the limits of what is allowed in the following days. I have to be careful. <color=\"red\">(-1 Command Power next Battle)</color>","\n",{"->":"endScene"},{"#f":1}],"endScene":[["^I have the ship brought back on course. It has cost us unnecessary time and supplies to take this diversion, and soon we will have to set course for a harbour. <color=\"blue\">A ship of the royal navy is following us</color>. I wonder what they want? It's not usual for them to attack neutral ships, even if these are their waters. There must be something fishy going on. <color=\"blue\">They're catching up and seem to be heading for a confrontation</color>. So let's give them what they deserve: A watery grave!","\n","ev","str","^endScene","/str",{"x()":"Unity_Event","exArgs":1},"pop","/ev","\n",["end",{"#f":5,"#n":"g-0"}],null],{"#f":1}],"Unity_Event":[{"temp=":"eventName"},"^[ EVENT: ","ev",{"VAR?":"eventName"},"out","/ev","^ ]","\n",{"#f":1}],"Get_State":[{"temp=":"id"},"^[ GET STATE: ","ev",{"VAR?":"id"},"out","/ev","^ ]","\n","ev",0,"/ev","~ret",{"#f":1}],"Add_State":[{"temp=":"amount"},{"temp=":"id"},"^[ ADD STATE: ","ev",{"VAR?":"id"},"out","/ev","^ - VALUE: ","ev",{"VAR?":"amount"},"out","/ev","^ ]","\n",{"#f":1}],"#f":1}],"listDefs":{}}