{"inkVersion":21,"root":[["\n",{"->":"main"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"main":[["^After the soldiers were defeated, we only really realised what kind of ship it was. It was a slave ship. That's nothing unusual for the navy. One of my men claims that slaves can be sold very expensively and that this could be to our advantage. Others of my crew urge me to release the slaves at the next harbour. They say that every man should have the opportunity to choose his own fate. I am faced with another decision. We could certainly use the money from the slave sale to upgrade the ship, which will be necessary for the coming confrontations with other frigates. What should I do?","\n","ev","str","^Sell them (100 Booty)","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Free them","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":[{"->":"verkaufen"},"\n",{"#f":5}],"c-1":[{"->":"befreien"},"\n",{"#f":5}]}],{"#f":1}],"verkaufen":["^I decided to exchange the slaves for good money at a sugar plantation. It was nothing personal, but we can make good use of the money. If we are defeated, the freed slaves won't be able to help us. So at least we were able to gain an advantage for ourselves and we weren't the ones who drove these people into slavery, rather we passed them on to an interested party. (+100 Booty)","\n","ev","str","^sell","/str",{"x()":"Unity_Event","exArgs":1},"pop","/ev","\n",{"->":"endScene"},{"#f":1}],"befreien":["ev","str","^free","/str",{"x()":"Unity_Event","exArgs":1},"pop","/ev","\n","^Most of the crew wanted to see the slaves free and I saw that as the right thing to do. I, who strive for freedom myself, felt connected to them. Now they can do whatever they want. My decision was very popular with the crew. As a pirate, you don't just rob, sometimes you're also the good guy in the story. (+1 Command Power next Battle)","\n",{"->":"endScene"},{"#f":1}],"endScene":[["^I hope the slaves don't talk too much about us. If the navy finds out that we also defeated a slave ship, that could mean additional trouble. We now need a bit of luck to find the wreck of Captain Silver as soon as possible. My navigator reports another sighting of a royal frigate. Well, I guess that's our fate, let's show those royalists that they'd better leave us alone.","\n","ev","str","^endScene","/str",{"x()":"Unity_Event","exArgs":1},"pop","/ev","\n",["end",{"#f":5,"#n":"g-0"}],null],{"#f":1}],"Unity_Event":[{"temp=":"eventName"},"^[ EVENT: ","ev",{"VAR?":"eventName"},"out","/ev","^ ]","\n",{"#f":1}],"Get_State":[{"temp=":"id"},"^[ GET STATE: ","ev",{"VAR?":"id"},"out","/ev","^ ]","\n","ev",0,"/ev","~ret",{"#f":1}],"Add_State":[{"temp=":"amount"},{"temp=":"id"},"^[ ADD STATE: ","ev",{"VAR?":"id"},"out","/ev","^ - VALUE: ","ev",{"VAR?":"amount"},"out","/ev","^ ]","\n",{"#f":1}],"#f":1}],"listDefs":{}}