{"inkVersion":21,"root":[["\n",{"->":"main"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"main":[["^Today, I took a look at the map with my navigator, and we have almost covered the entire route of Silver's ship. So, it won't be long before we find the wreck and can recover the treasure. I don't want to reveal it to the other men just yet, as it could cause unrest. The greed of a pirate should not be underestimated. Now, I face a choice. The waters ahead are not very deep, and the ship could suffer damage if we strictly follow the map. However, the detour would take several days, and without a doubt, some of my men will question my decision.","\n","ev","str","^Sail ahead","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Take the detour","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":[{"->":"Schaden"},"\n",{"#f":5}],"c-1":[{"->":"Umfahren"},"\n",{"#f":5}]}],{"#f":1}],"Schaden":["ev","str","^damage","/str",{"x()":"Unity_Event","exArgs":1},"pop","/ev","\n","^As expected, the water is just barely deep enough to follow the route. We are making progress, but the hull has suffered damage. The nearest port is still a few days away. We've managed to stabilize the situation, but it's not ideal. With all the battles we've already fought, it's only a matter of time before the next Navy ship comes to attack us. (-3 Shiphealth next Battle)","\n",{"->":"endScene"},{"#f":1}],"Umfahren":["^I ordered the detour. It would be foolish to take unnecessary risks now. Maybe it would have worked out, maybe not. The crew doesn't understand my decision, but I'm certain it's the best for everyone. However, unrest is spreading. Some are already openly questioning if I'm still the right person for the position of captain. I will show them that I am worthy. Once we have the treasure on board, no one will question me anymore. (-1 Command Power next Battle)","\n","ev","str","^detour","/str",{"x()":"Unity_Event","exArgs":1},"pop","/ev","\n",{"->":"endScene"},{"#f":1}],"endScene":[["^This time the navy really seems to mean business, with a frigate and a warship heading towards us. A warship is the largest class of ship that the navy has. A beast of the seas, more cannons than a man can count. Some of my men are starting to shiver. But the warship doesn't seem to be looking for a confrontation. Only the frigate seeks battle with us. Let's give the warship a show. Everyone to battle stations!","\n","ev","str","^endScene","/str",{"x()":"Unity_Event","exArgs":1},"pop","/ev","\n",["end",{"#f":5,"#n":"g-0"}],null],{"#f":1}],"Unity_Event":[{"temp=":"eventName"},"^[ EVENT: ","ev",{"VAR?":"eventName"},"out","/ev","^ ]","\n",{"#f":1}],"Get_State":[{"temp=":"id"},"^[ GET STATE: ","ev",{"VAR?":"id"},"out","/ev","^ ]","\n","ev",0,"/ev","~ret",{"#f":1}],"Add_State":[{"temp=":"amount"},{"temp=":"id"},"^[ ADD STATE: ","ev",{"VAR?":"id"},"out","/ev","^ - VALUE: ","ev",{"VAR?":"amount"},"out","/ev","^ ]","\n",{"#f":1}],"#f":1}],"listDefs":{}}